@extends('welcome')
@section('title', 'Пользовательское соглашение')
@section('content')
<div class="container">
            <h1 class="text-center mb-4">Пользовательское соглашение сайта runote-edu.ru</h1>
            <hr class="mb-5">

            <section class="mb-5">
                <h2 class="h4 mb-3">1. Общие положения</h2>
                <p class="lead">Регистрация и использование сайта <strong>runote-edu.ru</strong> означает безоговорочное и полное согласие пользователя с настоящим пользовательским соглашением. Если пользователь не согласен с каким-либо пунктом данного соглашения, он обязан немедленно прекратить использование сайта.</p>
            </section>

            <section class="mb-5">
                <h2 class="h4 mb-3">2. Право на изменение условий</h2>
                <p class="lead">Владелец сайта <strong>runote-edu.ru</strong> оставляет за собой право в любое время и без предварительного уведомления изменять, дополнять или удалять любые условия настоящего соглашения. Продолжение использования сайта после внесения изменений считается полным согласием пользователя с новыми условиями.</p>
            </section>

            <section class="mb-5">
                <h2 class="h4 mb-3">3. Обязанности пользователя</h2>
                <ul class="list-unstyled">
                    <li class="mb-2  d-flex">
                        <i class="bi bi-dot mt-1 me-2"></i><p class="lead"> Пользователь обязуется предоставлять только достоверную и актуальную информацию при регистрации и использовании сайта. В случае предоставления недостоверных данных владелец сайта имеет право заблокировать аккаунт пользователя без объяснения причин.
                    </p></li>
                    <li class="mb-2  d-flex">
                        <i class="bi bi-dot mt-1 me-2"></i><p class="lead"> Пользователь несет полную ответственность за сохранность своих учетных данных (логина и пароля) и обязуется не передавать их третьим лицам. Владелец сайта <strong>runote-edu.ru</strong> не несет ответственности за ущерб, возникший вследствие несанкционированного использования аккаунта пользователя.
                    </p></li>
                    <li class="mb-2 d-flex">
                        <i class="bi bi-dot mt-1 me-2"></i><p class="lead"> Пользователь обязуется не использовать сайт для действий, нарушающих законодательство, моральные и этические нормы, а также права третьих лиц. Владелец сайта вправе без предупреждения ограничить или прекратить доступ пользователя к сайту в случае подозрения на нарушение данных условий.
                   </p> </li>
                </ul>
            </section>

            <section class="mb-5">
                <h2 class="h4 mb-3">4. Права владельца сайта</h2>
                <ul class="list-unstyled" class="lead">
                    <li class="mb-2 d-flex">
                        <i class="bi bi-dot mt-1 me-2"></i><p class="lead"> Владелец сайта <strong>runote-edu.ru</strong> имеет исключительное право принимать любые решения, касающиеся функционирования сайта, включая, но не ограничиваясь, блокировкой пользователей, удалением контента и изменением функционала сайта.
                    </p></li>
                    <li class="mb-2 d-flex">
                        <i class="bi bi-dot mt-1 me-2"></i><p class="lead"> Владелец сайта не несет ответственности за любые убытки, прямые или косвенные, возникшие в результате использования или невозможности использования сайта.
                    </p></li>
                    <li class="mb-2 d-flex">
                        <i class="bi bi-dot mt-1 me-2"></i><p class="lead"> Владелец сайта вправе использовать, копировать, изменять и распространять любой контент, размещенный пользователем на сайте, без дополнительного согласия пользователя и без выплаты компенсаций.
                    </p></li>
                </ul>
            </section>

            <section class="mb-5">
                <h2 class="h4 mb-3">5. Обработка персональных данных</h2>
                <p class="lead">Пользователь дает безусловное согласие на сбор, хранение и обработку своих персональных данных в объеме, необходимом для функционирования сайта <strong>runote-edu.ru</strong>, а также на передачу этих данных третьим лицам по усмотрению владельца сайта.</p>
            </section>

            <section class="mb-5">
                <h2 class="h4 mb-3">6. Ограничение ответственности</h2>
                <p class="lead">Владелец сайта <strong>runote-edu.ru</strong> не гарантирует бесперебойную работу сайта и не несет ответственности за любые технические сбои, потерю данных или вред, причиненный в результате использования сайта.</p>
            </section>

            <section class="mb-5">
                <h2 class="h4 mb-3">7. Разрешение споров</h2>
                <p class="lead">Все споры и разногласия, возникающие из настоящего соглашения или в связи с ним, подлежат разрешению исключительно в соответствии с законодательством, выбранным владельцем сайта, и в юрисдикции, определяемой владельцем сайта.</p>
            </section>
        </div>
@endsection